Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: "Poky", which is pronounced *Pock*-ee, is the name of the Yocto Project's reference distribution or Reference OS Kit. This reference distribution is represented by a :term:`DISTRO` configuration file found in :yocto_git:`meta-poky </meta-yocto>`.
it_it: "Poky", che si pronuncia *Pock*-ee, è il nome della distribuzione di riferimento o kit del sistema operativo di riferimento di Yocto Project. Questa distribuzione di riferimento è rappresentata da un file di configurazione :term:`DISTRO` che si trova in :yocto_git:`meta-poky </meta-yocto>`.

source: "Untested" means that whilst the configurations are present in the project, we don't currently run the tests on any regular basis and new changes are not tested against them. We may take patches in these areas if they make sense but it is on a best effort only basis.
it_it: "Untested" significa che, sebbene le configurazioni siano presenti nel progetto, al momento non eseguiamo i test regolarmente e le nuove modifiche non vengono testate rispetto a queste. Potremmo accettare patch in queste aree se ritenute opportune, ma solo previo impegno.

source: "ftrace" essentially refers to everything included in the ``/tracing`` directory of the mounted debugfs filesystem (Yocto follows the standard convention and mounts it at ``/sys/kernel/debug``). All the files found in ``/sys/kernel/debug/tracing`` on a Yocto system are::
it_it: "ftrace" si riferisce essenzialmente a tutto ciò che è incluso nella directory ``/tracing`` del filesystem debugfs montato (Yocto segue la convenzione standard e lo monta in ``/sys/kernel/debug``). Tutti i file presenti in ``/sys/kernel/debug/tracing`` su un sistema Yocto sono::

source: "ftrace" literally refers to the "ftrace function tracer" but in reality this encompasses several related tracers along with the infrastructure that they all make use of.
it_it: "ftrace" si riferisce letteralmente al "ftrace function tracer" [tracer di funzioni ftrace], ma in realtà comprende diversi tracer correlati, insieme all'infrastruttura che tutti utilizzano.

source: 'crosstap' requires a local SDK build of the target system (or a build that includes 'tools-profile') in order to build kernel modules that can probe the target system.
it_it: 'crosstap' richiede una build SDK locale del sistema target (o una build che includa 'tools-profile') per compilare i moduli del kernel in grado di analizzare il sistema target.

source: **Acceptable:**
it_it: **Accettabile:**

source: **Add Your Layer to the Layer Configuration File:** Before you can use it, you must add the layer and its dependencies to your :ref:`structure-build-conf-bblayers.conf` file, which is found in the :term:`Build Directory` (``conf/``) directory.
it_it: **Aggiungere il Layer al File di Configurazione dei Layer:** Prima di poterlo utilizzare, si deve aggiungere il layer e le sue dipendenze al file :ref:`structure-build-conf-bblayers.conf`, che si trova nella directory :term:`Build Directory` (``conf/``).

source: **Add a new layer for any custom recipes and metadata you create**. Use the ``bitbake-layers create-layer`` command. The ``bitbake-layers`` tool also provides a number of other useful layer-related commands. See :ref:`dev-manual/layers:Creating Your Own Layer` section.
it_it: **Creazione di un nuovo layer per ricette e metadati personalizzati**. L'operazione viene eseguita tramite il comando ``bitbake-layers create-layer``. Il tool ``bitbake-layers`` offre inoltre comandi aggiuntivi per la gestione dei layer. Consultare la sezione :ref:`dev-manual/layers:Creating Your Own Layer`.

source: **An ambiguous definition: Package vs Recipe:** A recipe contains instructions the build system uses to create packages. Recipes and Packages are the difference between the front end and the result of the build process.
it_it: **Una definizione ambigua: Pacchetto contro Ricetta:** Una ricetta contiene le istruzioni che il sistema di compilazione utilizza per creare i pacchetti. Ricette e pacchetti rappresentano la differenza tra la fase iniziale (front end) e il risultato finale del processo di compilazione.

source: **Based on the layers you've chosen, make needed changes in your configuration**. For instance, assume you've chosen a machine type and added in the corresponding BSP layer. You'll then need to change the value of the :term:`MACHINE` variable in your configuration (using the :ref:`ref-fragments-builtin-core-machine` fragment) to point to that same machine type. There could be other layer-specific settings you need to change as well. Each layer has a ``README`` document that you can look at for this type of usage information.
it_it: **Modifica della configurazione in base ai layer scelti**. Ad esempio, supponiamo che sia stato scelto un tipo di macchina e aggiunto il layer BSP corrispondente. Si dovrà quindi modificare il valore della variabile :term:`MACHINE` nella configurazione (utilizzando il frammento :ref:`ref-fragments-builtin-core-machine`) in modo che punti a quello stesso tipo di macchina. Potrebbero esserci anche altre impostazioni specifiche del layer da modificare. Ogni layer ha un documento ``README`` consultabile per questo tipo di informazioni sull'utilizzo.

source: **Build your image and refine it**. Add what's missing and fix anything that's broken using your knowledge of the :ref:`workflow <sdk-manual/extensible:using \`\`devtool\`\` in your sdk workflow>` to identify where issues might be occurring.
it_it: **Compilare l'immagine e perfezionala**. Aggiungere ciò che manca e correggere eventuali problemi, sfruttando la conoscenza del :ref:`workflow <sdk-manual/extensible:using \`\`devtool\`\` in your sdk workflow>` per identificare le possibili cause dei problemi.

source: **Change the Configuration to Build for a Specific Machine:** The :term:`MACHINE` variable is defined by the :ref:`ref-fragments-builtin-core-machine` fragment. For this example, the ``meta-raspberrypi`` layer provides the :yocto_git:`raspberrypi5 </meta-raspberrypi/tree/conf/machine/raspberrypi5.conf>` machine, so let's make it the :term:`MACHINE` used for the build with ``bitbake-config-build``:
it_it: **Modificare la Configurazione per la Build su una Macchina Specifica:** La variabile :term:`MACHINE` è definita dal frammento :ref:`ref-fragments-builtin-core-machine`. In questo esempio, il layer ``meta-raspberrypi`` fornisce la macchina :yocto_git:`raspberrypi5 </meta-raspberrypi/tree/conf/machine/raspberrypi5.conf>`, quindi impostiamola come :term:`MACHINE` utilizzata per la compilazione con ``bitbake-config-build``:

source: **Clear historical or common-sense evidence** --- the project's change history clearly shows that a certain class of version bump is bug-fix only, or it is widely understood convention. For example, openssh's ``p`` suffix increments (``10.2p1`` to ``10.2p2``) and kmod's patch-level bumps are historically bug-fix only releases.
it_it: **Prove storiche o di buon senso inequivocabili** --- la cronologia delle modifiche del progetto mostra chiaramente che una determinata classe di aggiornamenti di versione riguarda solo la correzione di bug, oppure è una convenzione ampiamente riconosciuta. Ad esempio, gli incrementi del suffisso ``p`` di openssh (da ``10.2p1`` a ``10.2p2``) e gli aggiornamenti di livello di patch di kmod sono storicamente rilasci che riguardano solo la correzione di bug.

source: **Comprehensive List of Links and Other Documentation:** The :ref:`ref-manual/resources:links and related documentation` section in the Yocto Project Reference Manual provides a comprehensive list of all related links and other user documentation.
it_it: **Elenco Completo di Link e Altra Documentazione:** La sezione :ref:`ref-manual/resources:links and related documentation` nel Manuale di Riferimento di Yocto Project fornisce un elenco completo di tutti i link correlati e altra documentazione per gli utenti.

source: **Congratulations! You're well on your way.** Welcome to the Yocto Project community.
it_it: **Congratulazioni! Si è sulla buona strada.** Benvenuto nella community di Yocto Project.

source: **Consider creating your own distribution**. When you get to a certain level of customization, consider creating your own distribution rather than using the default reference distribution.
it_it: **Valutare la possibilità di creare una distribuzione personalizzata**. Quando si raggiunge un certo livello di personalizzazione, considerare la creazione di una distribuzione personalizzata anziché utilizzare quella di riferimento predefinita.

source: **Create your own image recipe:** There are a number of ways to create your own image recipe. We suggest you create your own image recipe as opposed to appending an existing recipe. It is trivial and easy to write an image recipe. Again, do not try appending to an existing image recipe. Create your own and do it right from the start.
it_it: **Creazione di una propria ricetta di immagine:** Esistono diversi modi per creare una ricetta di immagine personalizzata. Si consiglia di creare una propria ricetta di immagine anziché estenderne una esistente. La scrittura di una ricetta di immagine è un'operazione semplice e immediata. Si ribadisce l'indicazione di non tentare l'estensione di una ricetta di immagine esistente, bensì di crearne una propria fin dall'inizio per procedere correttamente.

source: **Create your own layer for the BSP you're going to use**. It is not common that you would need to create an entire BSP from scratch unless you have a *really* special device. Even if you are using an existing BSP, :ref:`create your own layer for the BSP <bsp-manual/bsp:creating a new bsp layer using the \`\`bitbake-layers\`\` script>`. For example, given a 64-bit x86-based machine, copy the conf/intel-corei7-64 definition and give the machine a relevant name (think board name, not product name). Make sure the layer configuration is dependent on the ``meta-intel`` layer (or at least, ``meta-intel`` remains in your :ref:`structure-build-conf-bblayers.conf` file). Now you can put your custom BSP settings into your layer and you can re-use it for different applications.
it_it: **Crea il layer per il BSP che si intende utilizzare**. Non è frequente dover creare un intero BSP da zero, a meno che non si disponga di un dispositivo *davvero* speciale. Anche se si utilizza un BSP esistente, :ref:`creare il proprio layer per il BSP <bsp-manual/bsp:creating a new bsp layer using the \`\`bitbake-layers\`\` script>`. Ad esempio, data una macchina basata su x86 a 64 bit, si copia la definizione conf/intel-corei7-64 e si assegna alla macchina un nome appropriato (si pensi al nome della scheda, non al nome del prodotto). La configurazione del layer deve dipendere dal layer ``meta-intel`` (o almeno, che, ``meta-intel`` rimanga nel file :ref:`structure-build-conf-bblayers.conf`). Ora si possono inserire le impostazioni BSP personalizzate nel layer e riutilizzarle per diverse applicazioni.

source: **Depending on what you primary interests are with the Yocto Project, you could consider any of the following reading:**
it_it: **A seconda degli interessi principali relativi a Yocto Project, si consiglia la lettura dei seguenti testi:**

source: **Discover the VSCode extension**: The `Yocto Project BitBake <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__ extension for the Visual Studio Code IDE provides language features and commands for working with the Yocto Project. If you are interested in using this extension, visit its `marketplace page <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__.
it_it: **Scoprire l'estensione per VSCode**: L'estensione `Yocto Project BitBake <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__ per l'IDE Visual Studio Code fornisce funzionalità di linguaggio e comandi per lavorare con Yocto Project. Se vi è interesse nell'utilizzo di questa estensione, è possibile visitarne la `pagina sul marketplace <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__.

source: **Do not put everything into one layer:** Use different layers to logically separate information in your build. As an example, you could have a BSP layer, a GUI layer, a distro configuration, middleware, or an application (e.g. "meta-filesystems", "meta-python", "meta-intel", and so forth). Putting your entire build into one layer limits and complicates future customization and reuse. Isolating information into layers, on the other hand, helps keep simplify future customizations and reuse.
it_it: **Non inserire tutto all'interno di un unico layer:** Utilizzare layer diversi per separare logicamente le informazioni all'interno della build. A titolo di esempio, è possibile disporre di un layer BSP, un layer GUI, una configurazione di distribuzione (distro), un middleware o un'applicazione (es. "meta-filesystems", "meta-python", "meta-intel" e così via). L'inserimento dell'intera compilazione in un solo layer limita e complica la futura personalizzazione e il riutilizzo. Al contrario, l'isolamento delle informazioni nei singoli layer contribuisce a semplificare le personalizzazioni e il riutilizzo futuri.

source: **Don't be fooled by documentation searching results:** Yocto Project documentation is always being updated. Unfortunately, when you use Google to search for Yocto Project concepts or terms, Google consistently searches and retrieves older versions of Yocto Project manuals. For example, searching for a particular topic using Google could result in a "hit" on a Yocto Project manual that is several releases old. To be sure that you are using the most current Yocto Project documentation, use the drop-down menu at the top of any of its page.
it_it: **Non farsi ingannare dai risultati di ricerca della documentazione:** La documentazione di Yocto Project viene aggiornata costantemente. Sfortunatamente, quando si utilizza Google per cercare concetti o termini relativi a Yocto Project, il motore di ricerca individua e restituisce sistematicamente versioni datate dei manuali. Ad esempio, la ricerca di uno specifico argomento su Google potrebbe portare a un risultato all'interno di un manuale di Yocto Project vecchio di diversi rilasci. Per avere la certezza di consultare la documentazione più recente di Yocto Project, si raccomanda di utilizzare il menù a tendina situato nella parte superiore di qualsiasi pagina.

source: **Examine Your Current Configuration:** When you set up the build environment, an configuration file named :ref:`toolcfg.conf <structure-build-conf-toolcfg.conf>` becomes available in a ``conf/`` sub-directory of the :term:`bitbake:BitBake build` directory. This file is automatically modified by the ``bitbake-config-build`` command-line tool. With this tool, list the currently enabled :term:`configuration fragments <Configuration Fragment>`:
it_it: **Esaminare la Configurazione Corrente:** Quando si configura l'ambiente di compilazione [build], un file di configurazione denominato :ref:`toolcfg.conf <structure-build-conf-toolcfg.conf>` diventa disponibile in una sottocartella ``conf/`` della directory :term:`bitbake:BitBake build`. Questo file viene modificato automaticamente dal tool da riga di comando ``bitbake-config-build``. Con questo tool, si elencano i :term:`frammenti di configurazione <Configuration Fragment>` attualmente abilitati:

source: **Exit QEMU:** Exit QEMU by either clicking on the shutdown icon or by typing ``Ctrl-C`` in the QEMU transcript window from which you evoked QEMU.
it_it: **Uscita da QEMU:** Per uscire da QEMU, cliccare sull'icona di spegnimento oppure digitare ``Ctrl-C`` nella finestra di trascrizione di QEMU da cui è stato avviato il programma.

source: **Finally, here is a list of the basic skills you will need as a systems developer. You must be able to:**
it_it: **Di seguito viene riportato l'elenco delle competenze fondamentali necessarie per uno sviluppatore di sistemi. È fondamentale essere in grado di:**

source: **Find a Layer:** Many BSP layers are available. The :oe_layerindex:`layer index <>` can be used to find such layers. This example adds the :yocto_git:`meta-raspberrypi </meta-raspberrypi>` BSP layer.
it_it: **Trovare un Layer:** Sono disponibili molti layer BSP. Il :oe_layerindex:`layer index <>` può essere utilizzato per trovare tali layer. Questo esempio aggiunge il layer BSP :yocto_git:`meta-raspberrypi </meta-raspberrypi>`.

source: **Find and acquire the best BSP for your target**. Use the :yocto_home:`Yocto Project Compatible Layers </software-overview/layers/>` or even the :oe_layerindex:`OpenEmbedded Layer Index <>` to find and acquire the best BSP for your target board. The Yocto Project layer index BSPs are regularly validated. The best place to get your first BSP is from your silicon manufacturer or board vendor - they can point you to their most qualified efforts. In general, for Intel silicon use ``meta-intel``, for Texas Instruments use ``meta-ti``, and so forth. Choose a BSP that has been tested with the same Yocto Project release that you've downloaded. Be aware that some BSPs may not be immediately supported on the very latest release, but they will be eventually.
it_it: **Trovare e acquistare il miglior BSP per la propria scheda target**. Usare lo :yocto_home:`Yocto Project Compatible Layers </software-overview/layers/>` o anche :oe_layerindex:`OpenEmbedded Layer Index <>` per trovare e acquistare il miglior BSP per la propria scheda target. I BSP dell'indice dei layer di Yocto Project vengono regolarmente validati. Il posto migliore per ottenere il primo BSP è il produttore del silicio o il fornitore della scheda: possono indicarti i loro BSP più qualificati. In generale, per i silicio Intel si usa ``meta-intel``, per Texas Instruments si usa ``meta-ti`` e così via. Scegliere un BSP testato con la stessa versione di Yocto Project scaricata. Si tenga che alcuni BSP potrebbero non essere immediatamente supportati sull'ultima versione, ma lo saranno in seguito.

source: **Get to know the layer index:** All layers can be found in the :oe_layerindex:`layer index <>`. Layers which have applied for Yocto Project Compatible status (structure continuity assurance and testing) can be found in the :yocto_home:`Yocto Project Compatible Layers </development/yocto-project-compatible-layers/>` page. Generally check the Compatible layer index first, and if you don't find the necessary layer check the general layer index. The layer index is an original artifact from the Open Embedded Project. As such, that index doesn't have the curating and testing that the Yocto Project provides on Yocto Project Compatible layer list, but the latter has fewer entries. Know that when you start searching in the layer index that not all layers have the same level of maturity, validation, or usability. Nor do searches prioritize displayed results. There is no easy way to help you through the process of choosing the best layer to suit your needs. Consequently, it is often trial and error, checking the mailing lists, or working with other developers through collaboration rooms that can help you make good choices.
it_it: **Conoscere l'indice dei layer:** Tutti i layer sono reperibili nel :oe_layerindex:`layer index <>`. I layer che hanno richiesto lo stato di compatibilità con Yocto Project (garanzia di continuità strutturale e test di conformità) sono disponibili alla pagina :yocto_home:`Yocto Project Compatible Layers </development/yocto-project-compatible-layers/>`. In genere si consiglia di consultare prima l'indice dei layer compatibili e, nel caso in cui non si trovi il layer necessario, di verificare l'indice generale dei layer. L'indice dei layer è un elemento originario del progetto Open Embedded. Di conseguenza, tale indice non dispone della supervisione e dei test che Yocto Project fornisce per l'elenco dei layer compatibili, sebbene quest'ultimo contenga meno voci. È opportuno sapere, quando si avvia una ricerca nell'indice dei layer, che non tutti i layer presentano lo stesso livello di maturità, convalida o usabilità. Inoltre, le ricerche non assegnano priorità ai risultati visualizzati. Non esiste un modo semplice per guidare l'utente nella scelta del layer più adatto alle proprie esigenze. Di conseguenza, si ricorre spesso a tentativi, alla consultazione delle mailing list o alla collaborazione con altri sviluppatori nelle apposite stanze virtuali per compiere le scelte migliori.

source: **Have Available the Yocto Project Reference Manual**: Unlike the rest of the Yocto Project manual set, this manual is comprised of material suited for reference rather than procedures. You can get build details, a closer look at how the pieces of the Yocto Project development environment work together, information on various technical details, guidance on migrating to a newer Yocto Project release, reference material on the directory structure, classes, and tasks. The :doc:`/ref-manual/index` also contains a fairly comprehensive glossary of variables used within the Yocto Project.
it_it: **Tenere a portata di mano il Manuale di Riferimento di Yocto Project**: A differenza degli altri manuali di Yocto Project, questo testo è composto da materiale adatto alla consultazione piuttosto che a procedure passo-passo. È possibile ottenere dettagli sulla build, un'analisi approfondita dell'integrazione dei componenti nell'ambiente di sviluppo di Yocto Project , informazioni su dettagli tecnici, indicazioni sulla migrazione a versioni più recenti di Yocto Project e materiale di riferimento su struttura delle directory, classi e task. :doc:`/ref-manual/index` contiene inoltre un glossario completo delle variabili utilizzate all'interno di Yocto Project.

source: **Here's how you decode "magic" folder names in tmp/work:** The build system fetches, unpacks, preprocesses, and builds. If something goes wrong, the build system reports to you directly the path to a folder where the temporary (build/tmp) files and packages reside resulting from the build. For a detailed example of this process, see the :yocto_wiki:`example </Cookbook:Example:Adding_packages_to_your_OS_image>`. Unfortunately this example is on an earlier release of Yocto Project.
it_it: **Decodifica dei nomi "magici" delle cartelle in tmp/work:** Il sistema di build esegue il recupero, l'estrazione, la pre-elaborazione e la compilazione. In caso di errore, il sistema segnala direttamente il percorso di una cartella in cui risiedono i file temporanei (build/tmp) e i pacchetti risultanti dalla compilazione. Per un esempio dettagliato di questo processo, si veda l' :yocto_wiki:`esempio </Cookbook:Example:Adding_packages_to_your_OS_image>`, sebbene sia basato su un rilascio precedente di Yocto Project.

source: **Initialize the Build Environment:** Source the ``init-build-env`` environment setup script within the :term:`bitbake:BitBake build` directory to set up the :term:`BitBake` build environment on your host:
it_it: **Inizializzare il Build Environment:** Eseguire lo script di configurazione dell'ambiente ``init-build-env`` nella directory :term:`bitbake:BitBake build` per configurare l'ambiente di build :term:`BitBake` sul proprio host:
